app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(permitted_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id") VALUES (?, ?)  [["content", "vapo 2"], ["todo_list_id", 2]]

  def complete
    @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2020-10-17 20:31:22.117938"], ["id", 3]]

  def destroy
    @todo_item = @todo_list.todo_items.find(params[:id])

    if @todo_item.destroy
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]

  def set_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_todo_item
    @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 3], ["LIMIT", 1]]