app/controllers/todo_items_controller.rb

  def set_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]